bench/results/java11/20260309T230709Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 6768.45, "p50": "3.34ms", "p95": "6.44ms", "p99": "7.63ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.55ms    1.31ms  34.05ms   72.06%\n    Req/Sec     1.70k   156.25     2.26k    75.10%\n  Latency Distribution\n     50%    3.34ms\n     75%    4.24ms\n     90%    5.25ms\n     99%    7.63ms\n  812466 requests in 2.00m, 185.18MB read\nRequests/sec:   6768.45\nTransfer/sec:      1.54MB"}